# Вариант 1
winter = ["1", "2", "12"]
spring = ["3", "4", "5"]
summer = ["6", "7", "8"]
autumn = ["9", "10", "11"]
n = input("Веедите месяц в виде целого числа от 1 до 12:")
if winter.count(n) > 0:
    print("Зима")
if spring.count(n) > 0:
    print("Весна")
if summer.count(n) > 0:
    print("Лето")
if autumn.count(n) > 0:
    print("Осень")
# вариант 2
i = input("Веедите месяц в виде целого числа от 1 до 12:")
my_dict = {"1": "Зима", "2": "Зима", "3": "Весна", "4": "Весна", "5": "Весна", "6": "Лето",
           "7": "Лето", "8": "Лето", "9": "Осень", "10": "Осень", "11": "Осень", "12": "Зима"}
print(my_dict[i])
